/* 
여러줄에 걸쳐있는 주석을 입력할때 사용한다
클래스와 파일이름 이름짓기(명령규칙)
무조건 첫글자는 대문자
가급적 2개이상의 단어를 조합하여 이름을 짓자.
사전에 (DIC)에 있는 단어를 1개만 사용할경우
Java에 기본적으로 있는 Keyword와 겹쳐서 문제를 일으키기도 한다
그러한 문제를 피하기 위해 사전에 있는 단어를 
사용하고자 하면 2개 이상의 단어를 조합하는 것이 좋다
2개이상의 단어를 조합하여 사용할경우
조합시 각단어의 첫글자는 무.조.건 대문자로한다.
이후 시작되는 단어 첫글자도 대문자로 사용한다.
또는 중간에 underbar(=under score'_')를 사용하기도한다


NationKorea : Camel Case 명명법
Nation_korea : snake case 명명법

Nation1, Nation_1 : 숫자등을 조합하여 사용가능

1Nation : 숫자로 시작하는경우 금지
Nation korea : 빈칸을 절대 사용할 수 없다.
*/

public class NationKorea {


}